'''
密码子  加序    减序    乘序    除序    奇偶    空序

2-3型   001     100     011     110     000     111
                                        010     101

4-2型   10      01      02      20      00      11
        13      31      12      21      22      33
        03      30      32      23
'''

遗传密码 = {
    'OOX':'A',
    'XOO':'B',
    'OXX':'C',
    'XXO':'D',
    'OOO':'E',
    'OXO':'E',
    'XXX':'F',
    'XOX':'F'
}

def _A(*参数):
    return 参数[0] + 参数[1]
def _B(*参数):
    return 参数[0] - 参数[1]
def _C(*参数):
    return 参数[0] * 参数[1]
def _D(*参数):
    return 参数[0] // 参数[1]
def _E(*参数):
    if 参数[1] % 2:
        return 参数[0] + 1
    else:
        return 参数[0] - 1
def _F(*参数):
    return 参数[0]

氨基酸 = {
    'A':_A,
    'B':_B,
    'C':_C,
    'D':_D,
    'E':_E,
    'F':_F,
}

def 蛋白质(底物, 氨基酸序列):
    中间物 = 底物
    for 序号 in range(len(氨基酸序列)):
        中间物 = 氨基酸[氨基酸序列[序号]](中间物, 序号 + 1)
    产物 = 中间物
    return 产物
